### 7. 데이터 합치기와 재구성

### 7.1 멀티 인덱스

In [1]:
#  모듈 불러오기
import numpy as np
import pandas as pd

Series의 멀티 인덱스

In [3]:
# 학생 점수 시리즈로 생성
# 인덱스는 단일x, 멀티o
s = pd.Series([ 85, 90, 78, 92, 88, 75 ], 
              index=[ ['1학년','1학년','1학년','2학년','2학년','2학년'],
                      ['a반','a반','b반','a반','b반','b반'] ]
             )

In [4]:
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     b반    75
dtype: int64

인덱스로 값 꺼내기

In [11]:
# 시리즈에서 1학년만 꺼내기
s['1학년']
# 1학년 a반만 조회
s.index
s.loc[ ('1학년', 'a반') ]
# 1학년의 a반과 b반 모두 가지고 오기(여러개 선택)
s.loc[ ('1학년', ['a반', 'b반'] ) ]

1학년  a반    85
     a반    90
     b반    78
dtype: int64

데이터 프레임의 멀티 인덱스

In [15]:
# Series: 한줄짜리 데이터
# DataFrame: 표 모양의 데이터

# 상품 판매 데이터를 데이터프레임으로 생성
# pd.DataFrame(2차원배열데이터)
# pd.DataFrame(데이터,[인덱스],[컬럼])
# 데이터: 판매데이터
# 행 인덱스: 멀티(연도-지점)
# 열 컬럼:
df = pd.DataFrame([ [50,60],[70,80],[100,110],[120,130] ],
                 index=[ ['2020년','2020년','2021년','2021년'], 
                         ['구월점','부평점','구월점','부평점' ] ] ,
                 columns=['제품1','제품2']
                 )
df

           제품1  제품2
2020년 구월점   50   60
      부평점   70   80
2021년 구월점  100  110
      부평점  120  130

In [20]:
# 2020년도 전체 판매량 조회
print(df.index) #행
print(df.columns) #열
df.loc['2020년']

MultiIndex([('2020년', '구월점'),
            ('2020년', '부평점'),
            ('2021년', '구월점'),
            ('2021년', '부평점')],
           )
Index(['제품1', '제품2'], dtype='object')

     제품1  제품2
구월점   50   60
부평점   70   80

In [22]:
# 2020년 구월점 판매량만 조회
df.loc['2020년', '구월점']
# 2021년 부평점의 제품2 판매량만 조회
df.loc[ ('2021년', '부평점'), '제품2' ]

np.int64(130)

#### 7.2 데이터 합치기

merge
- 두개의 데이터프레임을 하나로 합치는 함수
- 기준컬럼이 맞으면 연결

In [27]:
# 학생 데이터를 담아서 데이터프레임 생성
# pd.DataFrame(2차원배열)
# pd.DataFrame(dic)
df1 = pd.DataFrame( { '학번':[1,2,3], '이름':['철수','영희','민수'] } )
# 시험 점수 데이터를 담아서 데이터프레임 생성
df2 = pd.DataFrame({'학번':[1,2,4], '점수':[90,85,70]})

   학번  점수
0   1  90
1   2  85
2   4  70

merge의 종류
- inner join: 양쪽 데이터에서 공통된 부분만 가지고옴
- left join: 왼쪽 데이터는 모두 가지고 오고, 오른쪽은 겹치는 부분만
- right join: 온른쪽 데이터는 모두 가지고 오고, 왼쪽은 겹치는 부분만
- outer join: 양쪽 데이터를 모두 가지고옴

In [32]:
# 학생정보와 시험점수 합치기
# pd.merge(데이터1, 데이터2, 공통컬럼)

# inner join
pd.merge(df1, df2, on='학번')

   학번  이름  점수
0   1  철수  90
1   2  영희  85

In [33]:
# left join
# pd.merge(데이터1, 데이터2, 공통컬럼, [join 방식])
pd.merge(df1, df2, on='학번', how='left')

   학번  이름    점수
0   1  철수  90.0
1   2  영희  85.0
2   3  민수   NaN

In [34]:
# right join
# pd.merge(데이터1, 데이터2, 공통컬럼, [join 방식])
pd.merge(df1, df2, on='학번', how='right')

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   4  NaN  70

In [35]:
# outer join
pd.merge(df1, df2, on='학번', how='outer')

   학번   이름    점수
0   1   철수  90.0
1   2   영희  85.0
2   3   민수   NaN
3   4  NaN  70.0